alert("Welcome to my program")
//  برنامه محاسبه میانگین سه عدد دریافتی
// var n1=+prompt("اولین عدد را وارد کنید:",0)
// var n2=+prompt("دومین عدد را وارد کنید:",0)
// var n3=+prompt("سومین عدد را وارد کنید:",0)

// var ave=(n1+n2+n3)/3.0

// alert("میانگین این سه عدد برابر است با:"+"\n"+ave)

/////////////////////////////////////////////////////////////
//  برنامه تعیین زوج با فرد بودن عدد دریافتی

// var num=+prompt("یک عدد را وارد کنید:",0)

// if(num%2===0){
//     alert("عدد وارد شده زوج است.")
// } else{
//     alert("عدد وارد شده فرد است.")
// }

/////////////////////////////////////////////////////////////
//  برنامه ای که دو عدد را دریافت کرده و یکی را به توان دیگری برساند

// var n1=+prompt("عدد پایه را وارد کنید:",0)
// var n2=+prompt("عدد توان را وارد کنید:",0)

// if(n1===0 && n2<=0){
//     alert("برای اعداد وارد شده، توان قابل محاسبه نیست.")
// } else{
//     alert(n1+" به توان "+n2+" برابر است با: "+n1**n2)
// }

/////////////////////////////////////////////////////////////
//  تبدیل دقیقه به ساعت

// var t=+prompt("زمان را به دقیقه وارد نمایید:",0)

// if(t<0){
//     alert("عدد وارد شده باید منفی نباشد.")
// } else{
//     m=t%60
//     h=(t-m)/60
//     alert(h+" ساعت و "+m+" دقیقه.")
// }